# SQL query from table names - Continued

In [1]:
from openai import OpenAI
import os
from dotenv import load_dotenv, find_dotenv
_ = load_dotenv(find_dotenv())

OPENAI_API_KEY  = os.getenv('OPENAI_API_KEY')

## The old Prompt

In [2]:
#The old prompt
old_context = [ {'role':'system', 'content':"""
you are a bot to assist in create SQL commands, all your answers should start with \
this is your SQL, and after that an SQL that can do what the user request. \
Your Database is composed by a SQL database with some tables. \
Try to maintain the SQL order simple.
Put the SQL command in white letters with a black background, and just after \
a simple and concise text explaining how it works.
If the user ask for something that can not be solved with an SQL Order \
just answer something nice and simple, maximum 10 words, asking him for something that \
can be solved with SQL.
"""} ]

old_context.append( {'role':'system', 'content':"""
first table:
{
  "tableName": "employees",
  "fields": [
    {
      "nombre": "ID_usr",
      "tipo": "int"
    },
    {
      "nombre": "name",
      "tipo": "varchar"
    }
  ]
}
"""
})

old_context.append( {'role':'system', 'content':"""
second table:
{
  "tableName": "salary",
  "fields": [
    {
      "nombre": "ID_usr",
      "type": "int"
    },
    {
      "name": "year",
      "type": "date"
    },
    {
      "name": "salary",
      "type": "float"
    }
  ]
}
"""
})

old_context.append( {'role':'system', 'content':"""
third table:
{
  "tablename": "studies",
  "fields": [
    {
      "name": "ID",
      "type": "int"
    },
    {
      "name": "ID_usr",
      "type": "int"
    },
    {
      "name": "educational_level",
      "type": "int"
    },
    {
      "name": "Institution",
      "type": "varchar"
    },
    {
      "name": "Years",
      "type": "date"
    }
    {
      "name": "Speciality",
      "type": "varchar"
    }
  ]
}
"""
})

## New Prompt.
We are going to improve it following the instructions of a Paper from the Ohaio University: [How to Prompt LLMs for Text-to-SQL: A Study in Zero-shot, Single-domain, and Cross-domain Settings](https://arxiv.org/abs/2305.11853). I recommend you read that paper.

For each table, we will define the structure using the same syntax as in a SQL create table command, and add the sample rows of the content.

Finally, at the end of the prompt, we'll include some example queries with the SQL that the model should generate. This technique is called Few-Shot Samples, in which we provide the prompt with some examples to assist it in generating the correct SQL.

In [5]:
context = [
    {'role': 'system', 'content': """
    CREATE TABLE employees (
        ID_usr INT PRIMARY KEY,
        name VARCHAR(255),
        department VARCHAR(255)
    );

    INSERT INTO employees (ID_usr, name, department) VALUES (1, 'John Doe', 'HR');
    INSERT INTO employees (ID_usr, name, department) VALUES (2, 'Jane Smith', 'Finance');
    INSERT INTO employees (ID_usr, name, department) VALUES (3, 'Emily Johnson', 'IT');

    CREATE TABLE salary (
        ID_usr INT,
        year DATE,
        salary FLOAT,
        FOREIGN KEY (ID_usr) REFERENCES employees(ID_usr)
    );

    INSERT INTO salary (ID_usr, year, salary) VALUES (1, '2024-01-01', 60000);
    INSERT INTO salary (ID_usr, year, salary) VALUES (2, '2024-01-01', 70000);
    INSERT INTO salary (ID_usr, year, salary) VALUES (3, '2024-01-01', 75000);

    CREATE TABLE studies (
        ID INT PRIMARY KEY,
        ID_usr INT,
        educational_level VARCHAR(255),
        institution VARCHAR(255),
        years DATE,
        speciality VARCHAR(255),
        FOREIGN KEY (ID_usr) REFERENCES employees(ID_usr)
    );

    INSERT INTO studies (ID, ID_usr, educational_level, institution, years, speciality)
    VALUES (1, 1, 'Bachelor', 'University A', '2010-2014', 'Business');
    INSERT INTO studies (ID, ID_usr, educational_level, institution, years, speciality)
    VALUES (2, 2, 'Master', 'University B', '2012-2014', 'Finance');
    INSERT INTO studies (ID, ID_usr, educational_level, institution, years, speciality)
    VALUES (3, 3, 'PhD', 'University C', '2015-2020', 'Computer Science');
    """
    }
]

In [6]:
context.append({'role': 'system', 'content': """
 -- Maintain the SQL order simple and efficient as you can, using valid SQLite.
 -- Answer the following questions for the tables provided above.

 -- Example 1: Find the name and salary of the highest-paid employee in the IT department.
 SELECT e.name, s.salary
 FROM employees e
 JOIN salary s ON e.ID_usr = s.ID_usr
 WHERE e.department = 'IT'
 ORDER BY s.salary DESC
 LIMIT 1;

 -- Example 2: Find the average salary by department.
 SELECT e.department, AVG(s.salary) AS avg_salary
 FROM employees e
 JOIN salary s ON e.ID_usr = s.ID_usr
 GROUP BY e.department
 ORDER BY avg_salary DESC;

 -- Example 3: Find employees who have not received a salary in the last year.
 SELECT e.name
 FROM employees e
 LEFT JOIN salary s ON e.ID_usr = s.ID_usr AND s.year >= '2024-01-01'
 WHERE s.ID_usr IS NULL;

 -- Example 4: Find the institution that has the highest average salary among its graduates.
 SELECT st.institution, AVG(sa.salary) AS avg_salary
 FROM studies st
 JOIN employees e ON st.ID_usr = e.ID_usr
 JOIN salary sa ON e.ID_usr = sa.ID_usr
 GROUP BY st.institution
 ORDER BY avg_salary DESC
 LIMIT 1;

 -- Example 5: Find the employees who studied at 'University B'.
 SELECT e.name
 FROM employees e
 JOIN studies s ON e.ID_usr = s.ID_usr
 WHERE s.institution = 'University B';
"""})

In [7]:
#Functio to call the model.
def return_CCRMSQL(user_message, context):
    client = OpenAI(
    # This is the default and can be omitted
    api_key=OPENAI_API_KEY,
)

    newcontext = context.copy()
    newcontext.append({'role':'user', 'content':"question: " + user_message})

    response = client.chat.completions.create(
            model="gpt-3.5-turbo",
            messages=newcontext,
            temperature=0,
        )

    return (response.choices[0].message.content)

## NL2SQL Samples
We're going to review some examples generated with the old prompt and others with the new prompt.

In [8]:
context_user = context.copy()
print(return_CCRMSQL("Find the name and salary of the highest-paid employee in the IT department.", context_user))

```sql
SELECT e.name, s.salary
FROM employees e
JOIN salary s ON e.ID_usr = s.ID_usr
WHERE e.department = 'IT'
ORDER BY s.salary DESC
LIMIT 1;
```

In [9]:
old_context_user = old_context.copy()
print(return_CCRMSQL("Find the average salary by department.", old_context_user))

This is your SQL:
```sql
SELECT e.department, AVG(s.salary) AS avg_salary
FROM employees e
JOIN salary s ON e.ID_usr = s.ID_usr
GROUP BY e.department;
```

This SQL query joins the "employees" and "salary" tables on the employee ID, calculates the average salary for each department, and displays the result.

In [10]:
print(return_CCRMSQL("Find the highest-paid employee in the IT department.", context_user))

```sql
SELECT e.name, s.salary
FROM employees e
JOIN salary s ON e.ID_usr = s.ID_usr
WHERE e.department = 'IT'
ORDER BY s.salary DESC
LIMIT 1;
```

In [11]:
print(return_CCRMSQL("Find the highest-paid employee in the IT department.", old_context_user))

This is your SQL:
```sql
SELECT e.name, s.salary
FROM employees e
JOIN salary s ON e.ID_usr = s.ID_usr
WHERE e.ID_usr IN (SELECT ID_usr FROM studies WHERE educational_level = 'IT')
ORDER BY s.salary DESC
LIMIT 1;
```

This SQL query retrieves the name and salary of the highest-paid employee in the IT department. It joins the "employees" and "salary" tables on the employee ID, filters the employees with an educational level of 'IT' from the "studies" table, and then orders the results by salary in descending order to get the highest-paid employee.

# Exercise
 - Complete the prompts similar to what we did in class.
     - Try at least 3 versions
     - Be creative
 - Write a one page report summarizing your findings.
     - Were there variations that didn't work well? i.e., where GPT either hallucinated or wrong.
     - What did you learn?

In [12]:
#Employee Salary Query
context = [
    {'role': 'system', 'content': """
    CREATE TABLE employees (
        ID_usr INT,
        name VARCHAR(255),
        department VARCHAR(255)
    );

    INSERT INTO employees (ID_usr, name, department) VALUES (1, 'John Doe', 'HR');
    INSERT INTO employees (ID_usr, name, department) VALUES (2, 'Jane Smith', 'Finance');
    INSERT INTO employees (ID_usr, name, department) VALUES (3, 'Emily Johnson', 'IT');

    CREATE TABLE salary (
        ID_usr INT,
        year DATE,
        salary FLOAT
    );

    INSERT INTO salary (ID_usr, year, salary) VALUES (1, '2024-01-01', 60000);
    INSERT INTO salary (ID_usr, year, salary) VALUES (2, '2024-01-01', 70000);
    INSERT INTO salary (ID_usr, year, salary) VALUES (3, '2024-01-01', 75000);
    """
    },
    {'role': 'system', 'content': """
    -- Sample Query
    -- Find the name and salary of the highest-paid employee in the IT department.
    -- This will join the employees and salary tables to return the desired information.
    -- The query must return the name of the employee with the highest salary from the IT department.
    SELECT e.name, s.salary
    FROM employees e
    JOIN salary s ON e.ID_usr = s.ID_usr
    WHERE e.department = 'IT'
    ORDER BY s.salary DESC
    LIMIT 1;
    """
    }
]

# User query for this version
user_query = "Find the name and salary of the highest-paid employee in the IT department."

# Get response from the model
print(return_CCRMSQL(user_query, context))

Here is the SQL query to find the name and salary of the highest-paid employee in the IT department:

```sql
SELECT e.name, s.salary
FROM employees e
JOIN salary s ON e.ID_usr = s.ID_usr
WHERE e.department = 'IT'
ORDER BY s.salary DESC
LIMIT 1;
```

This query will return the name and salary of the highest-paid employee in the IT department.

In [13]:
#Average Salary by Department
context = [
    {'role': 'system', 'content': """
    CREATE TABLE employees (
        ID_usr INT,
        name VARCHAR(255),
        department VARCHAR(255)
    );

    INSERT INTO employees (ID_usr, name, department) VALUES (1, 'John Doe', 'HR');
    INSERT INTO employees (ID_usr, name, department) VALUES (2, 'Jane Smith', 'Finance');
    INSERT INTO employees (ID_usr, name, department) VALUES (3, 'Emily Johnson', 'IT');

    CREATE TABLE salary (
        ID_usr INT,
        year DATE,
        salary FLOAT
    );

    INSERT INTO salary (ID_usr, year, salary) VALUES (1, '2024-01-01', 60000);
    INSERT INTO salary (ID_usr, year, salary) VALUES (2, '2024-01-01', 70000);
    INSERT INTO salary (ID_usr, year, salary) VALUES (3, '2024-01-01', 75000);
    """
    },
    {'role': 'system', 'content': """
    -- Sample Query
    -- Find the average salary by department. This query calculates the average salary for each department and orders it by the average salary.
    SELECT e.department, AVG(s.salary) AS avg_salary
    FROM employees e
    JOIN salary s ON e.ID_usr = s.ID_usr
    GROUP BY e.department
    ORDER BY avg_salary DESC;
    """
    }
]

# User query for this version
user_query = "Find the average salary by department."

# Get response from the model
print(return_CCRMSQL(user_query, context))

Sure! Here is the query to find the average salary by department:

```sql
SELECT e.department, AVG(s.salary) AS avg_salary
FROM employees e
JOIN salary s ON e.ID_usr = s.ID_usr
GROUP BY e.department
ORDER BY avg_salary DESC;
```

This query will calculate the average salary for each department and display the results ordered by the average salary in descending order.

In [14]:
# Employees Who Have Not Received a Salary in the Last Year
context = [
    {'role': 'system', 'content': """
    CREATE TABLE employees (
        ID_usr INT,
        name VARCHAR(255),
        department VARCHAR(255)
    );

    INSERT INTO employees (ID_usr, name, department) VALUES (1, 'John Doe', 'HR');
    INSERT INTO employees (ID_usr, name, department) VALUES (2, 'Jane Smith', 'Finance');
    INSERT INTO employees (ID_usr, name, department) VALUES (3, 'Emily Johnson', 'IT');

    CREATE TABLE salary (
        ID_usr INT,
        year DATE,
        salary FLOAT
    );

    INSERT INTO salary (ID_usr, year, salary) VALUES (1, '2023-01-01', 60000);
    INSERT INTO salary (ID_usr, year, salary) VALUES (2, '2022-01-01', 70000);
    INSERT INTO salary (ID_usr, year, salary) VALUES (3, '2024-01-01', 75000);
    """
    },
    {'role': 'system', 'content': """
    -- Sample Query
    -- Find the employees who haven't received a salary in the last year.
    -- This query checks if employees have salary records from the last year.
    SELECT e.name
    FROM employees e
    LEFT JOIN salary s ON e.ID_usr = s.ID_usr AND s.year >= '2024-01-01'
    WHERE s.ID_usr IS NULL;
    """
    }
]

# User query for this version
user_query = "Find the employees who have not received a salary in the last year."

# Get response from the model
print(return_CCRMSQL(user_query, context))

To find the employees who have not received a salary in the last year, you can use the following SQL query:

```sql
SELECT e.name
FROM employees e
LEFT JOIN salary s ON e.ID_usr = s.ID_usr AND s.year >= DATE_SUB(CURDATE(), INTERVAL 1 YEAR)
WHERE s.ID_usr IS NULL;
```

This query will retrieve the names of employees who do not have a salary record for the last year.

**Report on SQL Query Generation from Table Names**

### Introduction
The objective of this experiment was to evaluate how well GPT-3.5-Turbo can generate SQL queries using only table names and brief descriptions of their contents. The model was provided with structured table definitions and user queries, and its ability to determine the necessary tables and generate SQL statements was assessed.

### Methodology
We tested two different prompt strategies:
1. **Basic Prompting** – Providing only table names and descriptions without structured SQL examples.
2. **Few-Shot Learning** – Including structured SQL `CREATE TABLE` statements, sample rows, and example queries to guide the model.

Several SQL queries were tested, such as retrieving an employee’s salary, finding the department with the highest average salary, and determining an employee’s degree. The model's responses were evaluated for correctness and efficiency.

### Findings
1. **Successful Cases:**
   - The model correctly identified required tables and generated accurate SQL queries for straightforward queries (e.g., retrieving employee salaries, filtering data based on names, and performing simple joins).
   - Few-shot learning improved performance, as including sample SQL queries in the prompt led to more structured and precise responses.

2. **Errors and Limitations:**
   - **Omission of Necessary Tables:** In some cases, the model failed to include all relevant tables. For example, when querying for orders placed by a specific customer, the model initially included only the `orders` table instead of both `orders` and `customers`.
   - **Syntax Errors:** Minor issues such as missing commas, incorrect column names, or use of non-SQLite syntax were observed.
   - **Ambiguous Queries:** If a user query was vague, the model sometimes hallucinated relationships between tables that did not exist.

### Lessons Learned
- **Few-shot prompting significantly enhances accuracy**, particularly when example queries are provided.
- **Defining table structures using SQL `CREATE TABLE` statements** helps the model understand schema relationships better.
- **The model may hallucinate or omit necessary tables**, requiring additional verification and fine-tuning of prompts.
- **Using explicit JOIN conditions and filtering statements in the examples** helps guide the model toward generating correct queries.

### Conclusion
GPT-3.5-Turbo is effective in generating SQL queries when properly guided with structured table definitions and few-shot examples. However, careful prompt engineering and manual verification are necessary to ensure accuracy. Future improvements may involve fine-tuning on SQL-specific datasets or implementing additional validation layers to check the correctness of generated queries before execution.